benchmark_results_20251124/axum_light.txt
Running 30s test @ http://127.0.0.1:8081/hello
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.86ms  568.26us   7.28ms   73.61%
    Req/Sec    27.75k     1.46k   35.90k    72.92%
  3317105 requests in 30.05s, 727.58MB read
Requests/sec: 110404.51
Transfer/sec:     24.22MB